BusinessProcesses/ОбменПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ОбменПаев</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/ОбменПаев/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем только на основании заявок на приобретение паев	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		
		РеквизитыОснования		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Пайщик");
		ЭтотОбъект.Организация	= РеквизитыОснования.Организация;
		ЭтотОбъект.Пайщик		= РеквизитыОснования.Пайщик;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация; 
		
		Если Задача.ТочкаМаршрута = БизнесПроцессы.ПогашениеПаев.ТочкиМаршрута.РасчетНДФЛ Тогда
			Задача.ТекстЗадачи = СтрШаблон(
				"Необходимо рассчитать НДФЛ по пайщику %1 (%2, %3)",
				ЭтотОбъект.Пайщик,
				ЭтотОбъект.Основание,
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"));
		КонецЕсли;
						
	КонецЦикла;
	
				
КонецПроцедуры

Процедура ОтправкаВДКЗаявкиНаОбменПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);
	
КонецПроцедуры

Процедура ОтправкаВДКЗаявкиНаОбменПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура СверкаЗаявокПоИтогамДняПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ТребуетсяЗакрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьЗакрытьДепозитарныйСчет");
	
КонецПроцедуры

Процедура СверкаЗаявокПоИтогамДняПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
		
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "СверкаЗаявокЗаДень",
		Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"));
	
КонецПроцедуры

Процедура ЗагрузкаДетальногоОтчетаПоИсполненнымОперациямОтДКПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
    БизнесПроцессы.ЗачислениеПаев.ЗагрузитьДанныеОтДКРегион(
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача,
		Отказ);
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоОбменуПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаДанныхОтДКПоОбменуПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РеквизитыЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Основание, "Дата, ПаевойИнвестиционныйФонд");
	
	БизнесПроцессы.ЗачислениеПаев.ЗагрузитьДанныеОтДКРегион(
		ЭтотОбъект.Организация,
		РеквизитыЗаявки.Дата,
		РеквизитыЗаявки.ПаевойИнвестиционныйФонд,
		Задача,
		Отказ);
		
КонецПроцедуры

Процедура ОтправкаДанныхВЛККОбОбменеПаевПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаДетальногоОтчетаПоИсполненнымОперациямОтДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаДанныхВЛККОбОбменеПаевПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	// Нужно выгрузить данные по двум ПИФам: на погашение и зачисление паев
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПогашениеПаев.Ссылка КАК Погашение,
		|	ЗачислениеПаев.Ссылка КАК Зачисление
		|ИЗ
		|	Документ.ПогашениеПаев КАК ПогашениеПаев
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗачислениеПаев КАК ЗачислениеПаев
		|		ПО ПогашениеПаев.Организация = ЗачислениеПаев.Организация
		|			И ПогашениеПаев.Заявка = ЗачислениеПаев.Заявка
		|			И ПогашениеПаев.Пайщик = ЗачислениеПаев.Пайщик
		|			И (ЗачислениеПаев.Проведен)
		|ГДЕ
		|	ПогашениеПаев.Организация = &Организация
		|	И ПогашениеПаев.Пайщик = &Пайщик
		|	И ПогашениеПаев.Заявка = &Заявка
		|	И ПогашениеПаев.Проведен");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Заявка",			ЭтотОбъект.Основание);
	Запрос.УстановитьПараметр("Пайщик",			ЭтотОбъект.Пайщик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
				
		ОбменСЛКК = Обработки.ОбменДаннымиСЛКК.Создать(); 
		
		ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
		
		// Погашение
		ОбменСЛКК.ВыгрузитьОперацииПоПаям(Выборка.Погашение, Отказ);
		
		Если Отказ Тогда
			// ##Оповещение
			Возврат;
		КонецЕсли;
		
		// Зачисление
		ОбменСЛКК.ВыгрузитьОперацииПоПаям(Выборка.Зачисление, Отказ);
		
		Если Отказ Тогда
			// ##Оповещение
			Возврат;
		КонецЕсли;
		
		// Меняем статус заявки
		ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "done", Отказ);
	
	Иначе
		// ##Оповещение
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормированиеПлатежногоПорученияНаВыводДенежныхСредствВПИФПоОбменуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
    ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры
